{
  "kamikaze": {
    "type": "M",
    "description": "Also called suicide-bomber. During voting round, kamikaze can kill themselves and take down another person with them. If another person is voted out, 3 people die. - bomber, target, 3rd person",
    "player": "During the day, announce yourself as bomber and tell who is the target",
    "narrator": ""
  },
  "framer": {
    "type": "M",
    "description": "[MAFIA] Also called forger. Assigns a person to be framed that night. If cop checks that person, narrator is supposed to say Mafia. ",
    "player": "At night, Tell who to frame",
    "narrator": "During night, ask who to frame and note down. If cop asks about that person, say Mafia"
  },
  "silencer": {
    "type": "M",
    "description": "[MAFIA] Assigns a person to be silenced during the day.",
    "player": "At night, tell who to silence",
    "narrator": "During night, ask who to silence and note down. During the day, announce who is silenced. If Doc visited that person, silencing doesn't work"
  },
  "godfather": {
    "type": "M",
    "description": "[MAFIA] If cop checks this person, Narrator has to say Villager.",
    "player": "Behave like normal mafia. But be aware that cop check on you will show villager",
    "narrator": "If cop asks about Godfather, say Villager"
  },
  "mafia": {
    "type": "M",
    "description": "[MAFIA] Generic mafia ",
    "player": "Generic mafia role",
    "narrator": ""
  },
  "idiot": {
    "type": "N",
    "description": "[NEUTRAL] Wins if voted out during the day. Loses if survives or killed by Mafia, or mafia win. ",
    "player": "Try to get voted out during the day",
    "narrator": "Announce if killed during the night"
  },
  "deputy": {
    "type": "V",
    "description": "[VILLAGE] Arrests someone during the night. They cannot vote next day, but can participate in discussion.",
    "player": "During night, tell who to arrest",
    "narrator": "Note down who is under arrest at night"
  },
  "granny": {
    "type": "V",
    "description": "[VILLAGE] Anyone who points to granny at night dies. If Mafia points, closest mafia dies. ",
    "player": "",
    "narrator": "At the end of night round, check who all have visited granny. Everyone dies. If mafia tries to kill granny at night, kill the closest mafia"
  },
  "creep": {
    "type": "V",
    "description": "[VILLAGE] Can check one person, and know the closest person who visited them that night. Must be the last role checked during the night. ",
    "player": "During night, tell a person to stalk. You'll know 1 or each person who visited them. ",
    "narrator": "during night round, ask about this role last."
  },
  "gravedigger": {
    "type": "V",
    "description": "[VILLAGE] Can speak to dead people and revive them at night, but have to sacrifice themselves. ",
    "player": "During night, tell which dead person is to be revived",
    "narrator": "During night, ask who is to be revived. If killed during the same night, revival doesn't count"
  },
  "sniper": {
    "type": "V",
    "description": "[VILLAGE] Can kill a person during the night. Sided with village ",
    "player": "During night, tell who is to be sniped",
    "narrator": "If snipe is on granny, kill sniper. or kill person, unless saved by the doc."
  },
  "bulletproof": {
    "type": "V",
    "description": "[VILLAGE] Has two lives if Mafia or kamikaze kill. Dies if voted out",
    "player": "",
    "narrator": "Check if person who is dying at night/Kamikaze tells is bulletproof. "
  },
  "doc": {
    "type": "V",
    "description": "[VILLAGE] Can save a person at night (including themselves). Killed if tries to save granny.",
    "player": "During night, ask who is to be saved.",
    "narrator": "Check if person dying(killed by mafia/sniper) is saved by the doc. Check if doc is visiting granny."
  },
  "cop": {
    "type": "V",
    "description": "[VILLAGE] Investigates a person, and narrator tells mafia/village according to role, unless Framed/Godfather. Dies at night if they visit Granny ",
    "player": "At night, ask who to investigate",
    "narrator": "Mafia if the person is mafia/framed by framer. Villager if Godfather/otherwise"
  },
  "twins": {
    "type": "V",
    "description": "[VILLAGE] Also called Freemasons/Masons. Knows few other villagers. ",
    "player": "",
    "narrator": ""
  },
  "villager": {
    "type": "V",
    "description": "[VILLAGE] Generic villager role",
    "player": "",
    "narrator": ""
  }
}
